$("form").on("submit", function(e) {
  e.preventDefault();
  var number = $('#number-input').val(), output = '';

  if ($('#checkbox').is(':checked')) {
  paragraph="<p> أبّْجٍّدٌّ هّْوّزَ هّْوّ اّلتّرًّتُّيّبّْ اٍّلَّأبّْجٍّدٌّيٌّ لَّلَّأحّْرًّفّْ اٍّلَّعَّرّبّْيّةْ وّيٌّختُّلَّفّْ عَّنِّ اٍّلَّتّرًّتُّيّبّْ اٍّلَّهّْجٍّائّيٌّ، وّصُّوّرّتُّهّ فّْيٌّ دٌّوّلَّ اٍّلَّمُّشّْرّقِّ اّلَّعّرًّبّْيٌّ كّْاٍّلَّآتّيّ: أبّْجٍّدٌّ هّْوّزَ حّْطَّيٌّ كّْلَّمُّنِّ سًّعَّفّْصُّ قِّرًّشّْتُّ ثّْخٌّذ ضَّظُغٌّ وّتُّشّبّْهّْ تُّرّتُّيّبّْ حّرًّوّفّ اٍّلَّهّْجٍّاٍّء قِّدٌّيٌّمُّاًٍّ فّْيٌّ اٍّلّلّغّة اٍّلَّعَّرًّبّيّةْ، وّقِّدٌّ أخٌّذ هّْذاٍّ اٍّلّتّرًّتُّيبّْ مُّنِّ اٍّلتُّرتُّيّبّْ اٍّلَّسًّاٍّمُّيٌّ اٍّلَّقّدّيّمُّ فّْيٌّ اٍّلَّعَّرّبّْيّةْ، وّاٍّلَّكّْلّمُّتُّينِّ ثّْخذ وضَّظغّ تُّسّمُّىَ مُّنِّ اٍّلَّرًّوّاٍّدٌّفّْ اٍّلَّتُّابّْعةْ، وّكّْاٍّنتّ تُّنِّقِّصُّ عَّنِّ اٍّلَّأحّْرًّفّْ اٍّلَّعّرًّبّْيّةْ بّْسًّتُّةْ حّْرًّوّفّْ، قِّبّْلَّ أنِّ يٌّجٍّمُّعَّهّْاٍّ 'نِّصُّرًّ بّْنِّ عَّاٍّصُّمُّ اٍّلَّذيٌّ يٌّعَّدٌّ مُّنِّ عَّلَّمُّاٍّء اٍّلَّنحّْوّ اٍّلَّبّاٍّرّزَيّنِّ فّْيٌّ زَمُّاٍّنهّْ، وّ يٌّقاّلَّ أنِّهّْ أوّلَّ مُّنِّ وُّْضَّعَّ اٍّلَّنّقِّاّطّ عَّلَّىَ اٍّلَّحّْرًّوّفّْ فّْيٌّ اٍّلَّلغّةْ اٍّلّعّرًّبّيّةْ بّْأمُّرًّ مُّنِّ اٍّلَّحّْجّاّجٍّ بّْنِّ يّوّسّفّْ</p>";
  }
  else { paragraph="<p> أبجد هوز هو الترتيب الأبجدي للأحرف العربية ويختلف عن الترتيب الهجائي، وصورته في دول المشرق العربي كالآتي: أبجد هوز حطي كلمن سعفص قرشت ثخذ ضظغ وتشبه ترتيب حروف الهجاء قديماً في اللغة العربية، وقد أخذ هذا الترتيب من الترتيب السامي القديم في العربية، والكلمتين ‘ثخذ' و’ضظغ’ تسمى من الروادف ‘التابعة’، وكانت تنقص عن الأحرف العربية بستة حروف، قبل أن يجمعها 'نصر بن عاصم' الذي يعد من علماء النحو البارزين في زمانه، و يقال أنه أول من وضع النقاط على الحروف في اللغة العربية بأمر من الحجاج بن يوسف </p>";}
  for (var i = 0; i < number; i++) {
    output += paragraph;
  }
  $('#output').html(output);
});

function copyToClipboard(element) {
  var $temp = $("<input>");
  $("body").append($temp);
  $temp.val($(element).text()).select();
  document.execCommand("copy");
  $temp.remove();
}
